                                  Встреча по проектам
*Продолжительный звук колокольчика*
*Вещает Ирина Вениаминовна*
Встреча нужна, чтобы мы за лето подумали о том,  что будем делать. Десятые классы три недели в июне занимаются практикой, делая проекты;
Дипломный проект — глобальная работа, завершающая вашу специальность. В десятом классе кончается программирование вместе с разделением по направлениям. Оценка за проект ставится в аттестат в отдельной строчке;
Проект нужен не только для аттестата, проект поможет при выступлении, проект — это хорошо, делайте проект и компартия лицея юудет гордиться. Если проект хороший, сможете поезать на конфереции и получить кучу приятного
на уровне баллов, помощи при поступлении и т.д.

*Александр Владимирович*
Суммарно около 40 лицеистов было на конференциях в США и получили призовые места. Окей. Но вас туда не пустят потому что санкции, вас пустят только в Китай.

*Ирина Вениаминовна сдала роль говорящего Николаю Константиновичу*
Проект — то, что может вас приблизить к реальной работе в програмировании. Так как вы будете работать над большим проектом, который включает в себя работу с заказчиком, работу с кодом и думанье. Короче, проф. подготовка;
Те, кто будут смотреть на ваши проекты — с шансами ваши будущие работодатели. Завриев будет давать возможность привыкать к работе;
Проект делается весь учеьный год. В сентябре-октябре нужно выбрать тему, а потом весь год происходит разработка проекта;
Начинается всё с того, что вы понимаете ТЗ и так далее. Потом уже кодите;
Один из самых сложных участков — ноябрь-декабрь. Нужно проанализировать предметнуюю область и установить задачу. В этот этап происходит диалог с заказчиком, который зачастую бывает сложным. Нужно разбираться с местом,
временем и так далее. Нужен будет очень высокий уровень самоконтроля чтобы знаиматься этим. Заказчик не даёт вам готовую тему, так что нужно будет самому понять, что от вас нужно и написать себе ТЗ, которое устроит и заказчика,
и выпонителя;
Январь-апрель — этап основной разработки;
Май-июнь — этап разработки, тестирования и написания документации к проекту. Кроме проекта в любом случае нужна будет 20страничная дипломная записка, в которой описана вся работа над проектом, детальное его описание и т.д.
Во время года есть несколько предзащит, на которых надо будет представить предварительный результат. Вас всегда смогут контролировать и проверять, что вы что-то делаете и меняете;
Один из самых важных вопросов — кому это надо и чем это лучше аналогов;
Требования к проекту: он должен быть достаточно сложным для того чтобы выполняться целый год. Задача проекта в том, чтобы сделать что-то, нужное другим людям. Можно написать какое-нибудь приложение или ещё что-нибудь;
Проекты бывают двух типов:
Первый — заказной. У него есть заказчик. Он даёт вам задачу, которую вы решаете;
Второй — стартап. Вы сами что-нибдуь придумываете, что и реализуете. /*ремарка. Игровые проекты работают плохо потому что вы конкурируете с гигантами. Надо или придумать интересную и простую механику, или у вас получится
ухудшенная версия какой-то игры, делая которую вы помрёте. Не надо так делать, если не уверены. Делайте лучше приложения. К примеру, делали фитнес-приложение, которое работало под виндафоном АААААААА ЗА ЧТО ВЫ УБИЛИ ВИНДАФОН, МАЙКРОСОФТ*/
Когда делаете проект, надо выбирать реалистично. Вы должны одновременно и удержаться на достаточно высоком уровне, и не сделать что-то невыполнимое или что-нибудь очень простое;
Если у вас есть идеи проектов, уже надо начинать их формулировать;
Списка тем вам никто не даст. Всем лень, труд будет бесполезным. Темы определяются диалогом с заказчиком. Изначально проекты делятся по направлениям, о которых будет сказано ниже;
К примеру, было создано приложение, которое имитировало нормальное разложение музыкальной конструкции. Такое было сделано в этом году;
Кто-то сделал драм-машину, которая работала для всех типов музыки;

/*Ремарка от Александра Владимировича*/
Проекты может представлять максимум два человека;
/*Ремарка кончилась*/

Пример проекта, который может быть очень полезным и получить высокие рещультаты на конкурсах: плагин для Гугл Поиска, который сортировал все результаты;
Лицейские проекты могут выходить на очень высокий уроень качества, а потом реально применяться в реальной жизни;

*Анна Олеговна*
Проект — это то, чем запомнится десятый класс. Проект — ваша головная боль, и контролировать вас будут не очень сильно. Чем раньше вы начнёте заниматься этим и думать об этом, тем лучше. В идеале, **сегодня** надо сегодня
понять, куда будете дивгаться, чтобы летом уже начать делать что-то на тему проекта. Курсы с навыками, самостоятельное обучение и так далее;

*Слово передаётся Александру Владимировичу*
Будет папка со всеми материалами, которые будут давать информацию о том, что такое проект и как его есть;

Первым вопросом, котоырй все задают, будет "Как найти заказчика?". Надо смотреть на востребованные направления и искать заказчиков там. В нашем случае конференция=конкурс. Все, кто проводит конференции по проектам,
Одно из самых актуальных направлений сейчас — компьютерное зрение. /*область, которая изучает фото, видео и так далее*/. Один из проектов на эту тему был о том, чтобы определять эмоции на лице человека. Задача была в том, чтобы
определять микроэмоции, из которых составляются остальные ДВАДЦАТЬ СЕМЬ. Это проект, который находится на грани науки и компьютерных технологий. Это хорошо;

//Простите, я не в состоянии конспектировать Алексанлра Владимировича. Тут идёт много информации о том, что сейчас актуально, что делали на эту тему, что можно поделать и т.д.

*Анна Олеговна*
Как перподаваатель ВУЗа предупреждают, что хорошие проекты тянут на средний диплом среднего ВУЗа. Так что надо работать;
Сразу после того, как мы все окажемся в десятом классе, мы окажемся в инжинерном классе. Это проект, который работает в Москве и распространяется по всей стране. Нужна будет физика;
Из инжинерности класса следуют плюсы и минусы;
Из плюсов: вы получаете кучу дополнительной активности в ВУЗах и так далее. Вас примут много где и расскажут ного чего. Ещё у нас будет больше уроков. Ееееее;
Недалеко от лицея, на Юго-Западной, находится Технопарк "Альтаир". Он предлагает бюджетную IT-Школу Самсунг. программирование там будет достаточно простым, так что рассматривать это надо главным образом как возможность потренироваться в работе. Там помогут
с мобильной разработкой. В этом году там отучились уже четверов програмистов, которые её оценивают на 4\5. В основном там будут плюсы и мобильная разработка;


Существует другой путь написания проекта. Он вряд ли будет впечатляющим. Вы получите хороший проект, который смодет выйти на конференцию и дать вам баллов. Никакого восхищения вы, скорее всего, не получите, но это вариант;
Если вы делаете проект в "Альтаире", вы получаете три часа на выполнение проекта раз в неделю. Проект быудет практически готов к декабрю. К февралю вы будете уже готовы его защищать. Весной вам будет спокойнее, а выступать с ним
можно будет как в десятом, так и в одинадцатом классе. Такие проекты часто требуют доделывания в лицее. В теории оттуда можно будет свалить, но лучше этого не делать. Попробуйте понять как можно раньше;
Надо определиться, готовы ли вы работать с заказчиком, учиться новому и получить уникальный проект;
Или же можно жить спокойно, выступать на конференциях, на которые вас отправят, и получить все плюсы, но надо смириться с тем, что ничего гениального вам не создать;
Особенно туда стоит идти, если вы собираетесь посутпать в МИРЭА;
На тему этого есть их рекламный ролик. Ссылка на него будет в Шизе;
В идеале надо будет брать тему, которая может быть усложнена чтобы получить действительно хороший результат не на четвёрку;

Записываться по направлениям можно будет уже от 8 июня. Все первые занятия в сентябре-декабре будут проходить в дистанционном формате. После предзащиты при удачном её завершнеии с ноября до начало февраля примерно 70% учеников
переходят на очную систему там же. Список направлений будет выложен в форме;
Программирование в лицее намного сильнее, чем то же самое в "Альтаире", так что пусть вы и будете чувствовать себя умными, но будете малость разочарованы;
!На направление с информатикой идти не надо потому что там максимально скучно, так что ничего вы там нормального не получится. Анна Олеговна не рекомендует;
Радиоэлектроника — хорошее направление. Там в основном Ардуино;
AR там неплохой, но VR лучше не трогать. Там может быть грустно из-за того, что вас могут немного обмануть на оборудование;
Есть файлик с отзывами людей, которые там учились. Опрос был анонимным;
Ещё можно будте прийти на защиты проектов и посмотреть на то, что будет происходить. В первый день будут сильные дипломы, во второй — более слабые;
