              Преобразнование типов
Правила неявного преобразования типов:
  *Правила неявного преобразования типов*
В операторе присваивания (=) конечный результат всегда приводится к типу переменной в левой частию.

Автоматически преобразование произойдёт, если:
  Оба типа совместимы;
  Конечный тип больше исходного;
Если целый тип меньше, чем int,то арифметические операции преобразовывают результат в int автоматически.
float и double помогают эффективно хранить данные. Они даже больше Long.

Явное преобразование типов;
(тип) Переменная;
      Вызов функции;
      Выражение;
Можно применять только на свой страх и риск, могут потеряться важные части данных, при чём ошибок выводить вам никто не будет.
